#1, 2, 3 더하기
    

'''
0 : 0 -> 0개
1 : 1 -> 1개
2 : 1, 2 -> 2개
3 : 1+1+1, 1+2, 2+1, 3 -> 4개
4 : 1+1+1+1, 1+1+2, 1+2+1, 2+1+1, 2+2, 1+3, 3+1 -> 7개
5 : 1+1+1+1+1, 1+1+2+1, 1+1+1+2, 1+2+1+1+1, 2+1+1+1+1, 2+2+1, 2+1+2, 1+2+2, 1+3+1, 3+1+1, 1+1+3, 2+3, 3+2 -> 13

d[n] = d[n-1]+d[n-2]+d[n-3]  점화식
'''


n = int(input())  #테스트 케이스의 개수
test = []

for i in range(n):
    test.append(int(input()))

dp =[0]*(max(test)+1)
dp[0] = 0
dp[1] = 1
dp[2] = 2
dp[3] = 4
dp[4] = 7


for i in range(5,max(test)+1):
    dp[i] = dp[i-3]+ dp[i-2]+ dp[i-1]
    
for i in test:
    print(dp[i])


    
    